{
    "personal": {
        "name": "Keyur Jivani",
        "title": "Full Stack Developer",
        "bio": "Results-driven Full Stack Developer with a strong foundation in software engineering and a passion for building modern, user-centric web applications. Skilled in crafting scalable solutions, solving complex problems, and adapting quickly to new technologies. Brings a proactive mindset and a focus on continuous learning to every team environment.",
        "companyBio": "Welcome to our innovative IT company! We specialize in delivering cutting-edge software solutions that transform businesses and drive digital growth. Our expert team combines technical excellence with creative problem-solving to build scalable, modern applications that exceed expectations.",
        "image": "/keyur_pic.jpg",
        "email": "keyurpatel1149@gmail.com",
        "phone": "+91 8141351199",
        "location": "Ahmedabad, Gujarat, India",
        "linkedinUrl": "https://www.linkedin.com/in/keyurjivani"
    },
    "showServices": false,
    "skills": {
        "Frontend": ["Angular", "TypeScript", "JavaScript"],
        "Backend": ["Node.js", "Python", ".Net Core"],
        "Database": ["PostgreSQL", "MsSql", "SQL"],
        "DevOps & Tools": ["AWS", "Docker"],
        "Concepts": ["RESTful APIs", "Microservices", "Agile Development", "Version Control (Git)", "CI/CD"]
    },
    "experience": [{
            "id": 1,
            "company": "TatvaSoft",
            "position": "Software Developer",
            "location": "Ahmedabad, Gujarat, India",
            "startDate": "2024-07",
            "endDate": "Present",
            "description": "Developed scalable SaaS and on-premises enterprise applications using modern web frameworks, RESTful APIs, and relational databases. Designed and implemented multi-tenant architecture with client-specific configuration panels. Used Dapper ORM with stored procedures for high-performance data access. Managed IIS deployments and environment-specific configurations. Implemented role-based access control (RBAC). Participated in Scrum ceremonies including planning, stand-ups, demos, and retrospectives."
        },
        {
            "id": 2,
            "company": "TatvaSoft",
            "position": "Software Developer Trainee",
            "location": "Ahmedabad, Gujarat, India",
            "startDate": "2024-01",
            "endDate": "2024-06",
            "description": "Developed a healthcare service platform using ASP.NET Core MVC, ORM tools, and PostgreSQL. Built modules for patient requests, doctor scheduling, and admin management. Applied Entity Framework Code First for database modeling, migrations, and schema management. Collaborated in an Agile Scrum team focusing on clean code and continuous delivery."
        }
    ],
    "projects": [{
            "id": 1,
            "title": "Accounting & Inventory Management System",
            "technologies": [
                "Angular",
                ".NET Core WebAPI",
                "SQL Server",
                "Dapper",
                "SFTP"
            ],
            "description": "Engineered a robust multi-tenant platform for SaaS and on-premise models, adopted by 100% of clients. Streamlined core modules including accounting, inventory, and loyalty programs, handling 90% of client operations. Optimized SQL operations using Dapper with stored procedures, improving backend performance by 5%. Integrated SFTP-based file management for upload, storage, and retrieval—eliminated server-side auto-sync logic, improving file handling performance by 30%. Reduced server CPU load by 10% and improved response time by 30% using async operations. Integrated linting and static analysis tools in Angular and .NET, increasing maintainability by 10% and developer-friendliness by 30%. Upgraded tech stack from .NET Core 3.1 to .NET 8 and Angular 8 to Angular 16. Deployed Angular Web Workers and Inline Workers to improve UI responsiveness by 30%."
        },
        {
            "id": 2,
            "title": "Healthcare Portal",
            "technologies": [".NET Core MVC", "PostgreSQL", "Entity Framework"],
            "description": "Developed and deployed role-based access modules for patients, doctors, and admins, improving workflow efficiency by 25%. Integrated secure login and consultation workflows aligned with healthcare compliance standards. Utilized Entity Framework (Database First) for efficient schema mapping and database operations. Optimized data handling by improving stored procedures, reducing query execution time by 10%."
        },
        {
            "id": 3,
            "title": "Employee Learning Management System (SaaS)",
            "technologies": ["Angular", ".NET Core WebAPI", "PostgreSQL", "EF Core"],
            "description": "Built scalable modules for course management, training tracking, and reading time analytics—enhancing learning insights by 30%. Architected a multi-tenant system ensuring secure company-wise data isolation. Reduced API calls and improved backend performance by 5% through query optimization. Added Angular Inline Web Workers to process complex tasks in the background, reducing UI freezing by 10%. Followed Agile/Scrum methodologies with 90% on-time sprint completion."
        }
    ],
    "education": [{
        "id": 1,
        "institution": "Dharmsinh Desai University, Nadiad",
        "degree": "Bachelor of Technology in Computer Engineering",
        "startDate": "2020",
        "endDate": "2024"
    }],
    "certifications": [
        {
            "id": 1,
            "name": "AWS Certified Solutions Architect",
            "issuer": "Amazon Web Services",
            "issueDate": "2024",
            "credentialId": "AWS-SAA-2024-001",
            "validUntil": "2027",
            "skills": ["AWS", "Cloud Architecture", "Solutions Design"]
        },
        {
            "id": 2,
            "name": "Microsoft Azure Fundamentals",
            "issuer": "Microsoft",
            "issueDate": "2023",
            "credentialId": "AZ-900-2023-002",
            "validUntil": "2026",
            "skills": ["Azure", "Cloud Computing", "DevOps"]
        },
        {
            "id": 3,
            "name": "Angular Certified Developer",
            "issuer": "Angular",
            "issueDate": "2023",
            "credentialId": "ACD-2023-003",
            "validUntil": "2025",
            "skills": ["Angular", "TypeScript", "Frontend Development"]
        }
    ],
    "social": {
        "github": "https://github.com/keyur1149",
        "linkedin": "https://www.linkedin.com/in/keyurjivani",
        "email": "keyurpatel1149@gmail.com"
    }
}